jmdapozzo/components/ledPanel/examples/mbi5026/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.4.1 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_LED_PANEL_INTERFACE_SPI=y
CONFIG_LED_PANEL_MATRIX_M6_16X8=y
CONFIG_LED_PANEL_MODULE_WIDTH=3
CONFIG_LED_PANEL_MODULE_HEIGHT=2
CONFIG_LV_COLOR_DEPTH_8=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_UNSCII_8=y
CONFIG_LV_FONT_UNSCII_16=y
CONFIG_LV_USE_QRCODE=y
